alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
 /*!
 * @file OpenFIREserial.cpp
 * @brief Serial RX buffer reading routines.
 *
 * @copyright alessandro-satanassi, https://github.com/alessandro-satanassi, 2026
 * @copyright GNU Lesser General Public License
 *
 * @author [Alessandro Satanassi](alessandro@cittini.it)
 * @version V2.0
 * @date 2026
 *
 * I thank you for producing the first original code:
 *
 * @copyright That One Seong, 2025
 * @copyright GNU Lesser General Public License
 */ 

#include <Arduino.h>

#include "OpenFIREserial.h"
#include "OpenFIREprefs.h"
#include "OpenFIREFeedback.h"
#include "OpenFIRElights.h"
#include "boards/OpenFIREshared.h"
#include "OpenFIREcommon.h"

#include "OpenFIREweb.h"

// ============ [ESP32_PORT] ============
// redefinition of Serial to handle wireless serial connections / redifinizione di Serial per gestire le connessione wireless seriali
#ifdef OPENFIRE_WIRELESS_ENABLE
    extern Stream* Serial_OpenFIRE_Stream;
    #ifdef Serial
        #define AUX_SERIAL Serial
        #undef Serial
    #endif
    #define Serial (*Serial_OpenFIRE_Stream)
#endif // OPENFIRE_WIRELESS_ENABLE
// ============ [ESP32_PORT] ============
// END redefinition of Serial to handle wireless serial connections / fine redifinizione di Serial per gestire le connessione wireless seriali ========

#ifdef ARDUINO_ARCH_ESP32  // [ESP32_PORT]
    #define delay(ms) vTaskDelay(pdMS_TO_TICKS(ms))                    
#endif //ARDUINO_ARCH_ESP32


#ifdef MAMEHOOKER
void OF_Serial::SerialProcessing()
{
    // For more info about Serial commands, see the OpenFIRE repo wiki.

    switch(Serial.read()) {
        // Start Signal
        case 'S':
          if(serialMode)
              Serial.println("SERIALREAD: Detected Serial Start command while already in Serial handoff mode!");
          // TODO: handle the other Start line bits? this assume equiv of `S6`
          else {
              serialMode = true;
              OF_FFB::FFBShutdown();

              #ifdef USES_SOLENOID
              serialSolCustomHoldLength = 0;
              serialSolCustomPauseLength = 0;
              #endif // USES_SOLENOID

              #ifdef USES_RUMBLE
              serialRumbCustomHoldLength = 0;
              serialRumbCustomPauseLength = 0;
              #endif // USES_RUMBLE

              #ifdef LED_ENABLE
                  // Set the LEDs to a mid-intense white.
                  OF_RGB::LedUpdate(127, 127, 127);
              #endif // LED_ENABLE

              #ifdef USES_DISPLAY
                  // init basic display to show mamehook icon
                  if(FW_Common::gunMode == FW_Const::GunMode_Run)
                      FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Mamehook_Single, FW_Common::buttons.analogOutput);
              #endif // USES_DISPLAY
          }
          break;
        // Modesetting Signal
        case 'M':
          switch(Serial.read()) {
              // input mode
              case '0':
                Serial.read(); // nomf
                switch(Serial.read()) {
                    case '2': // "hybrid" - just use the default m&kb mode
                    case '0': // mouse & kb 
                      FW_Common::buttons.analogOutput = false;
                      break;
                    // gamepad
                    case '1':
                      FW_Common::buttons.analogOutput = true;
                      Gamepad16.stickRight = (Serial.peek() == 'L') ? true: false;
                      break;
                    // official "MiSTer optimized" mode
                    case '9':
                      FW_Common::buttons.analogOutput = true;
                      Gamepad16.stickRight = true;
                      // HACK SHACK - testing MiSTer-friendly default gamepad maps
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3 = PAD_A,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_A].reportCode3       = PAD_B,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_B].reportCode3       = PAD_X,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Reload].reportCode3  = PAD_Y,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Start].reportCode3   = PAD_START,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Select].reportCode3  = PAD_SELECT,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Up].reportCode3      = PAD_UP,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Down].reportCode3    = PAD_DOWN,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Left].reportCode3    = PAD_LEFT,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Right].reportCode3   = PAD_RIGHT,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Pedal].reportCode3   = PAD_LB,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Pedal2].reportCode3  = PAD_RB,
                      LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Pump].reportCode3    = PAD_C;
                      #ifdef USES_DISPLAY
                          FW_Common::OLED.mister = true;
                      #endif // USES_DISPLAY
                      break;
                }
                FW_Common::buttons.ReleaseAll();
                #ifdef USES_DISPLAY
                    if(!serialMode && FW_Common::gunMode == FW_Const::GunMode_Run)
                        FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Normal, FW_Common::buttons.analogOutput);
                    else if(serialMode && FW_Common::gunMode == FW_Const::GunMode_Run &&
                            FW_Common::OLED.serialDisplayType > ExtDisplay::ScreenSerial_None &&
                            FW_Common::OLED.serialDisplayType < ExtDisplay::ScreenSerial_Both) {
                        FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Mamehook_Single, FW_Common::buttons.analogOutput);
                    }
                #endif // USES_DISPLAY
                break;
              // offscreen button mode
              case '1':
                Serial.read(); // nomf
                switch(Serial.read()) {
                    // cursor in bottom left - just use disabled
                    case '1':
                    // "true offscreen shot" mode - just use disabled for now
                    case '3':
                    // disabled
                    case '0':
                      memcpy(&LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType2,
                             &OF_Prefs::backupButtonDesc[FW_Const::BtnIdx_Trigger][2],
                             sizeof(LightgunButtons::Desc_s::reportType)*2);
                      // reset remapping for low button users if M1x2 was previously called
                      if(OF_Prefs::toggles[OF_Const::lowButtonsMode])
                          memcpy(&LightgunButtons::ButtonDesc[FW_Const::BtnIdx_A].reportType,
                                 OF_Prefs::backupButtonDesc[FW_Const::BtnIdx_A],
                                 sizeof(LightgunButtons::Desc_s::reportType)*2);
                      serialMappingsOffscreenShot = false;
                      break;
                    // offscreen button
                    case '2':
                      memcpy(&LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType2,
                             OF_Prefs::backupButtonDesc[FW_Const::BtnIdx_A],
                             sizeof(LightgunButtons::Desc_s::reportType)*2);
                      // remap bindings for low button users to make e.g. VCop 3 playable with 1 btn + pedal
                      if(OF_Prefs::toggles[OF_Const::lowButtonsMode])
                          memcpy(&LightgunButtons::ButtonDesc[FW_Const::BtnIdx_A].reportType,
                                 OF_Prefs::backupButtonDesc[FW_Const::BtnIdx_Reload],
                                 sizeof(LightgunButtons::Desc_s::reportType)*2);
                      serialMappingsOffscreenShot = true;
                      break;
                }
                FW_Common::UpdateBindings(false);
                break;
              // pedal functionality
              case '2':
                Serial.read();                                         // nomf
                switch(Serial.read()) {
                    // separate button (default to original binds)
                    case '0':
                      memcpy(&LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Pedal].reportType,
                             OF_Prefs::backupButtonDesc[FW_Const::BtnIdx_Pedal],
                             sizeof(OF_Prefs::backupButtonDesc[0]));
                      serialMappingsPedalMode = 0;
                      break;
                    // make reload button (mapping of Button A)
                    case '1':
                      memcpy(&LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Pedal].reportType,
                             OF_Prefs::backupButtonDesc[FW_Const::BtnIdx_A],
                             sizeof(OF_Prefs::backupButtonDesc[0]));
                      serialMappingsPedalMode = 1;
                      break;
                    // make middle mouse button (mapping of Button B, useful for low buttons mode & e.g. using VCop3 ES mode)
                    case '2':
                      memcpy(&LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Pedal].reportType,
                             OF_Prefs::backupButtonDesc[FW_Const::BtnIdx_B],
                             sizeof(OF_Prefs::backupButtonDesc[0]));
                      serialMappingsPedalMode = 2;
                      break;
                }
                FW_Common::UpdateBindings(false);
                break;
              // aspect ratio correction
              case '3':
                Serial.read(); // nomf
                serialARcorrection = Serial.read() - '0';
                if(!serialMode) {
                    if(serialARcorrection) { Serial.println("Setting 4:3 correction on!"); }
                    else { Serial.println("Setting 4:3 correction off!"); }
                }
                break;
              #ifdef USES_TEMP
              // temp sensor disabling (why?)
              case '4':
                Serial.read(); // nomf
                Serial.read();
                break;
              #endif // USES_TEMP
              // autoreload (TODO: maybe?)
              case '5':
                Serial.read(); // nomf
                Serial.read();
                break;
              // rumble only mode (enable Rumble FF)
              case '6':
                Serial.read(); // nomf
                switch(Serial.read()) {
                    // disable
                    case '0':
                      if(OF_Prefs::pins[OF_Const::solenoidSwitch] == -1 && OF_Prefs::pins[OF_Const::solenoidPin] >= 0)
                          OF_Prefs::toggles[OF_Const::solenoid] = true;
                      if(OF_Prefs::pins[OF_Const::rumblePin] >= 0) 
                          OF_Prefs::toggles[OF_Const::rumbleFF] = false;
                      break;
                    // enable
                    case '1':
                      if(OF_Prefs::pins[OF_Const::rumbleSwitch] == -1 && OF_Prefs::pins[OF_Const::rumblePin] >= 0) { OF_Prefs::toggles[OF_Const::rumble] = true; }
                      if(OF_Prefs::pins[OF_Const::solenoidSwitch] == -1 && OF_Prefs::pins[OF_Const::solenoidPin] >= 0) { OF_Prefs::toggles[OF_Const::solenoid] = false; }
                      if(OF_Prefs::pins[OF_Const::rumblePin] >= 0) { OF_Prefs::toggles[OF_Const::rumbleFF] = true; }
                      break;
                }
                OF_FFB::FFBShutdown();
                break;
              #ifdef USES_SOLENOID
              // solenoid automatic mode
              case '8':
                Serial.read(); // Nomf the padding bit.
                switch(Serial.read()) {
                // "auto"
                case '1':
                    OF_FFB::burstFireActive = true;
                    OF_Prefs::toggles[OF_Const::autofire] = false;
                    break;
                // "always on"
                case '2':
                    OF_Prefs::toggles[OF_Const::autofire] = true;
                    OF_FFB::burstFireActive = false;
                    break;
                // disabled
                case '0':
                    OF_Prefs::toggles[OF_Const::autofire] = false;
                    OF_FFB::burstFireActive = false;
                    break;
                }
                break;
              #endif // USES_SOLENOID
              #ifdef USES_DISPLAY
              case 'D':
                Serial.read(); // Nomf padding byte
                switch(Serial.read()) {
                    case '0':
                      FW_Common::OLED.serialDisplayType = ExtDisplay::ScreenSerial_None;
                      break;
                    case '1':
                      FW_Common::OLED.serialDisplayType = ExtDisplay::ScreenSerial_Life;
                      break;
                    case '2':
                      FW_Common::OLED.serialDisplayType = ExtDisplay::ScreenSerial_Ammo;
                      break;
                    case '3':
                      FW_Common::OLED.serialDisplayType = ExtDisplay::ScreenSerial_Both;
                      break;
                }
                
                if(Serial.read() == 'B') {
                    FW_Common::OLED.lifeBar = true;
		            FW_Common::dispMaxLife = 0;
                } else FW_Common::OLED.lifeBar = false;

