alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
                // prevent glitching if currently in pause mode
                if(FW_Common::gunMode == FW_Const::GunMode_Run) {
                    if(FW_Common::OLED.serialDisplayType == ExtDisplay::ScreenSerial_Both)
                        FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Mamehook_Dual);
                    else if(FW_Common::OLED.serialDisplayType > ExtDisplay::ScreenSerial_None)
                        FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Mamehook_Single, FW_Common::buttons.analogOutput);
                }
                break;
              #endif // USES_DISPLAY
              default:
                if(!serialMode) Serial.println("SERIALREAD: Serial modesetting command found, but no valid set bit found!");
                break;
          }
          break;
        // End Signal
        // Check to make sure that 'E' is not actually a glitched command bit
        // by ensuring that there's no adjacent bit.
        case 'E':
          // Either "no buffer" (-1) or any of the non-visual control bits, mainly Carriage Returns/Newlines
          // (as Windows sends these implicitly in `echo` commands by default)
          if(Serial.peek() <= 32) {
              if(!serialMode) Serial.println("SERIALREAD: Detected Serial End command while Serial Handoff mode is already off!");
              else {
                  serialMode = false;
                  memset(serialQueue, false, sizeof(serialQueue));
                  serialARcorrection = false;
                  serialMappingsOffscreenShot = false;
                  serialMappingsPedalMode = 0;
                  #ifdef USES_DISPLAY
                      FW_Common::OLED.serialDisplayType = ExtDisplay::ScreenSerial_None;
                      if(FW_Common::gunMode == FW_Const::GunMode_Run) FW_Common::OLED.ScreenModeChange(ExtDisplay::Screen_Normal, FW_Common::buttons.analogOutput);
                  #endif // USES_DISPLAY
                  #ifdef LED_ENABLE
                      // Clear any stale serial LED pulses
                      serialLEDPulseColorMap = 0b00000000;
                      serialLEDPulses = 0;
                      serialLEDPulsesLast = 0;
                      serialLEDPulseRising = true;
                      serialLEDR = 0;
                      serialLEDG = 0;
                      serialLEDB = 0;
                      serialLEDChange = false;
                      if(FW_Common::gunMode == FW_Const::GunMode_Run)
                        OF_RGB::LedOff(); // Turn it off, and let lastSeen handle it from here.
                  #endif // LED_ENABLE
                  #ifdef USES_RUMBLE
                      #ifdef ARDUINO_ARCH_ESP32
                        analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0); // [ESP32_PORT] per ESP32
                      #else // rp2040
                      digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                      #endif
                      serialRumbPulseStage = 0;
                      serialRumbPulses = 0;
                      serialRumbPulsesLast = 0;
                      serialRumbCustomHoldLength = 0;
                      serialRumbCustomPauseLength = 0;
                  #endif // USES_RUMBLE
                  #ifdef USES_SOLENOID
                      OF_FFB::SetSolenoid(LOW);
                      serialSolPulses = 0;
                      serialSolPulsesLast = 0;
                      serialSolCustomHoldLength = 0;
                      serialSolCustomPauseLength = 0;
                  #endif // USES_SOLENOID
                  FW_Common::buttons.ReleaseAll();
                  // remap back to defaults, in case they were changed
                  FW_Common::UpdateBindings(true);
                  Serial.println("Received end serial pulse, releasing FF override.");
              }
              break;
          }
          break;
        // owo SPECIAL SETUP EH?
        case 'X':
          switch(Serial.read()) {
              // Set Autofire Interval Length
              case 'I':
                OF_FFB::autofireDoubleLengthWait = Serial.read() - '0';
                break;
              // Remap player numbers
              case 'R':
              {
                char serialInput = Serial.read();
                if(serialInput >= '1' && serialInput <= '4') {
                    FW_Common::playerStartBtn = serialInput;
                    FW_Common::playerSelectBtn = serialInput + 4;
                    FW_Common::UpdateBindings(false);
                } else Serial.println("SERIALREAD: Player remap command called, but an invalid or no slot number was declared!");
                break;
              }
              default:
                Serial.println("SERIALREAD: Internal setting cmd detected, but not valid!");
                Serial.println("Internally recognized commands are:");
                Serial.println("I(nterval Autofire)2/3/4 / R(emap)1/2/3/4");
                break;
          }
          // End of 'X'
          break;
        // Enter Docked Mode
        case OF_Const::sDock1:
          // Dock on the serial link, unless an App (e.g. a page over WiFi in web
          // configuration mode) is already docked.
          if(Serial_available(1) && Serial.read() == OF_Const::sDock2 && !appSerialSessionActive)
            AppSerialEnterDockedMode(WebAppLink::SerialPort);
          break;
        // Force Feedback
        case 'F':
          switch(Serial.read()) {
              #ifdef USES_SOLENOID
              // Solenoid bits
              case '0':
                Serial.read(); // nomf the padding
                switch(Serial.read()) {
                // Solenoid "on" command
                case '1':
                    #ifdef USES_TEMP
                    // block every other signal if temp is at warning threshold
                    if(OF_Prefs::pins[OF_Const::tempPin] > -1) {
                        switch(OF_FFB::tempStatus) {
                        case OF_FFB::Temp_Safe:
                            serialQueue[SerialQueue_Solenoid] = true;
                            break;
                        case OF_FFB::Temp_Warning:
                            if(serialSolTempBuffer) serialQueue[SerialQueue_Solenoid] = true;
                            serialSolTempBuffer = !serialSolTempBuffer;
                            break;
                        case OF_FFB::Temp_Fatal:
                        default:
                            break;
                        }
                    } else 
                    #endif // USES_TEMP
                    serialQueue[SerialQueue_Solenoid] = true;
                    break;
                // Solenoid "pulse" command (only if not already pulsing)
                case '2':
                    if(!serialQueue[SerialQueue_SolPulse]) {
                        Serial.read(); // nomf the padding bit.
                        if(Serial.peek() >= '0' & Serial.peek() <= '9') {
                            serialQueue[SerialQueue_SolPulse] = true;
                            char serialInputS[4] = {0,0,0,0};
                            for(uint n = 0; n < 3; ++n) {
                                serialInputS[n] = Serial.read();
                                if(Serial.peek() < '0' || Serial.peek() > '9')
                                    break;
                            }
                            serialSolPulses = atoi(serialInputS);
                            if(!serialSolPulses) serialSolPulses++;
                            serialSolPulsesLast = 0;
                        }
                    }
                    break;
                // Solenoid "off" command
                case '0':
                    serialQueue[SerialQueue_Solenoid] = false, serialQueue[SerialQueue_SolPulse] = false;
                    break;
                }
                break;
              #endif // USES_SOLENOID
              #ifdef USES_RUMBLE
              // Rumble bits
              case '1':
                Serial.read(); // nomf the padding
                switch(Serial.read()) {
                // Rumble "on" command
                case '1':
                    serialQueue[SerialQueue_Rumble] = true;
                    break;
                // Rumble "pulse" command (only if not already pulsing)
                case '2':
                    if(!serialQueue[SerialQueue_RumbPulse]) {
                        Serial.read(); // nomf the padding
                        if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                            serialQueue[SerialQueue_RumbPulse] = true;
                            char serialInputS[4] = {0,0,0,0};
                            for(uint n = 0; n < 3; ++n) {
                                serialInputS[n] = Serial.read();
                                if(Serial.peek() < '0' || Serial.peek() > '9')
                                    break;
                            }
                            serialRumbPulses = atoi(serialInputS);
                            if(!serialRumbPulses) serialRumbPulses++;
                            serialRumbPulsesLast = 0;
                        }
                    }
                    break;
                // Rumble "off" command
                case '0':
                    serialQueue[SerialQueue_Rumble] = false, serialQueue[SerialQueue_RumbPulse] = false;
                    break;
                }
                break;
              #endif // USES_RUMBLE
              #ifdef LED_ENABLE
              // LED Red bits
              case '2':
                Serial.read(); // nomf the padding
                switch(Serial.read()) {
                // LED Red "static on" command
                case '1':
                    Serial.read(); // nomf
                    if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                        serialLEDChange = true;
                        serialQueue[SerialQueue_Red] = true;
                        char serialInputS[4] = {0,0,0,0};
                        for(uint n = 0; n < 3; ++n) {
                            serialInputS[n] = Serial.read();
                            if(Serial.peek() < '0' || Serial.peek() > '9')
                                break;
                        }
                        // Static emitting overrides pulse bits
                        serialLEDR = atoi(serialInputS);
                        serialQueue[SerialQueue_LEDPulse] = false;
                        serialLEDPulseColorMap = 0;
                    }
                    break;
                // LED Red "pulse" command (only if not already pulsing)
                case '2':
                    if(!serialQueue[SerialQueue_LEDPulse]) {
                        Serial.read(); // nomf
                        if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                            serialLEDChange = true, serialQueue[SerialQueue_LEDPulse] = true,
                            serialLEDPulseColorMap = 0b00000001; // Set the R LED as the one pulsing only (overwrites the others).
                            char serialInputS[4] = {0,0,0,0};
                            for(uint n = 0; n < 3; ++n) {
                                serialInputS[n] = Serial.read();
                                if(Serial.peek() < '0' || Serial.peek() > '9')
                                    break;
                            }
                            serialLEDPulses = atoi(serialInputS);
                            serialLEDPulsesLast = 0;
                        }
                    }
                    break;
                // LED Red "off" command
                case '0':
                    serialLEDChange = true, serialQueue[SerialQueue_Red] = false, serialQueue[SerialQueue_LEDPulse] = false,
                    serialLEDR = 0, serialLEDPulseColorMap = 0;
                    break;
                }
                break;
              // LED Green bits
              case '3':
                Serial.read(); // nomf the padding
                switch(Serial.read()) {
                // LED Green "static on" command
                case '1':
                    Serial.read(); // nomf
                    if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                        serialLEDChange = true, serialQueue[SerialQueue_Green] = true;
                        char serialInputS[4] = {0,0,0,0};
                        for(uint n = 0; n < 3; ++n) {
                            serialInputS[n] = Serial.read();
                            if(Serial.peek() < '0' || Serial.peek() > '9')
                                break;
                        }
                        serialLEDG = atoi(serialInputS);
                        serialQueue[SerialQueue_LEDPulse] = false, serialLEDPulseColorMap = 0;
                    }
                    break;
                // LED Green "pulse" command (only if not already pulsing)
                case '2':
                    if(!serialQueue[SerialQueue_LEDPulse]) {
                        Serial.read(); // nomf
                        if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                            serialLEDChange = true, serialQueue[SerialQueue_LEDPulse] = true,
                            serialLEDPulseColorMap = 0b00000010; // Set the G LED as the one pulsing only (overwrites the others).
                            char serialInputS[4] = {0,0,0,0};
                            for(uint n = 0; n < 3; ++n) {
                                serialInputS[n] = Serial.read();
                                if(Serial.peek() < '0' || Serial.peek() > '9')
                                    break;
                            }
                            serialLEDPulses = atoi(serialInputS);
                            serialLEDPulsesLast = 0;
                        }
                    }
                    break;
                // LED Green "off" command
                case '0':
                    serialLEDChange = true,
                    serialQueue[SerialQueue_Green] = false, serialQueue[SerialQueue_LEDPulse] = false,
                    serialLEDG = 0, serialLEDPulseColorMap = 0;
                    break;
                }
                break;
              // LED Blue bits
              case '4':
                Serial.read(); // nomf the padding
                switch(Serial.read()) {
                // LED Blue "static on" command
                case '1':
                    Serial.read(); // nomf
                    if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                        serialLEDChange = true, serialQueue[SerialQueue_Blue] = true;
                        char serialInputS[4] = {0,0,0,0};
                        for(uint n = 0; n < 3; ++n) {
                            serialInputS[n] = Serial.read();
                            if(Serial.peek() < '0' || Serial.peek() > '9')
                                break;
                        }
                        serialLEDB = atoi(serialInputS);
                        serialQueue[SerialQueue_LEDPulse] = false;
                        serialLEDPulseColorMap = 0;
                    }
                    break;
                // LED Blue "pulse" command (only if not already pulsing)
                case '2':
                    if(!serialQueue[SerialQueue_LEDPulse]) {
                        Serial.read(); // nomf
                        if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                            serialLEDChange = true, serialQueue[SerialQueue_LEDPulse] = true,
                            serialLEDPulseColorMap = 0b00000100; // Set the B LED as the one pulsing only (overwrites the others).
                            char serialInputS[4] = {0,0,0,0};
                            for(uint n = 0; n < 3; ++n) {
                                serialInputS[n] = Serial.read();
                                if(Serial.peek() < '0' || Serial.peek() > '9')
                                    break;
                            }
                            serialLEDPulses = atoi(serialInputS);
                            serialLEDPulsesLast = 0;
                        }
                    }
                    break;
                // LED Blue "off" command
                case '0':
                    serialLEDChange = true,
                    serialQueue[SerialQueue_Blue] = false, serialQueue[SerialQueue_LEDPulse] = false,
                    serialLEDB = 0, serialLEDPulseColorMap = 0;
                    break;
                }
                break;
              #endif // LED_ENABLE
              #ifdef USES_DISPLAY
              case 'D':
                switch(Serial.read()) {
                case 'A':
                    Serial.read(); // nomf the padding
                    if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                        char serialInputS[4] = {0,0,0,0};
                        for(uint n = 0; n < 3; ++n) {
                            serialInputS[n] = Serial.read();
                            if(Serial.peek() < '0' || Serial.peek() > '9')
                                break;
                        }
                        serialAmmoCount = atoi(serialInputS);
                        serialAmmoCount = constrain(serialAmmoCount, 0, 99);
                        serialDisplayChange = true;
                    }
                    break;
                case 'L':
                    Serial.read(); // nomf the padding
                    if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                        char serialInputS[4] = {0,0,0,0};
                        for(uint n = 0; n < 3; ++n) {
                            serialInputS[n] = Serial.read();
                            if(Serial.peek() < '0' || Serial.peek() > '9')
                                break;
                        }

                        serialLifeCount = atoi(serialInputS);
                        if(FW_Common::OLED.lifeBar) {
                            if(serialLifeCount > FW_Common::dispMaxLife)
                                FW_Common::dispMaxLife = serialLifeCount;
                            FW_Common::dispLifePercentage = (100 * serialLifeCount) / FW_Common::dispMaxLife; // Calculate the Life % to show 
                        }
                        serialDisplayChange = true;
                    }
                    break;
                }
                break;
              #endif // USES_DISPLAY
              #if !defined(USES_SOLENOID) && !defined(USES_RUMBLE) && !defined(LED_ENABLE)
              default:
                //Serial.println("SERIALREAD: Feedback command detected, but no feedback devices are built into this firmware!");
                break;
              #endif
          }
          // End of 'F'
          break;
        // Custom Pulse Overrides
        case 'R':
          switch(Serial.read()) {
              // Solenoid
              case '0':
                Serial.read(); // nomf
                if(Serial.peek() >= '0' && Serial.peek() <= '2') {
                    char serialInput = Serial.read();
                    Serial.read(); // nomf
                    if(Serial.peek() >= '0' && Serial.peek() <='9') {
                        char serialInputS[4] = {0,0,0,0};
                        for(uint n = 0; n < 3; ++n) {
                            serialInputS[n] = Serial.read();
                            if(Serial.peek() < '0' || Serial.peek() > '9')
                                break;
                        }

                        switch(serialInput) {
                        // hold length
                        case '0':
                            serialSolCustomHoldLength = atoi(serialInputS);
                            break;
                        // pause length
                        case '1':
                            serialSolCustomPauseLength = atoi(serialInputS);
                            break;
                        // analog(?)
                        case '2':
                        default:
                            break;
                        }
                    }
                }
                break;
              // Rumble
              case '1':
                Serial.read(); // nomf
                if(Serial.peek() >= '0' && Serial.peek() <= '2') {
                    char serialInput = Serial.read();
                    Serial.read(); // nomf
                    if(Serial.peek() >= '0' && Serial.peek() <= '9') {
                        char serialInputS[4] = {0,0,0,0};
                        for(uint n = 0; n < 3; ++n) {
                            serialInputS[n] = Serial.read();
                            if(Serial.peek() < '0' || Serial.peek() > '9')
                                break;
                        }

                        switch(serialInput) {
                        // hold length
                        case '0':
                            serialRumbCustomHoldLength = atoi(serialInputS);
                            break;
                        // pause length
                        case '1':
                            serialRumbCustomPauseLength = atoi(serialInputS);
                            break;
                        // analog(?)
                        case '2':
                        default:
                            break;
                        }
                    }
                }
                break;
              // LED Red
              case '2':
              // LED Green
              case '3':
              // LED Blue
              case '4':
              default:
                break;
          }
          // End of 'R'
          break;
    }
}

void OF_Serial::SerialHandling()
{
    // The Mamehook feedback system handles most of the timing for us.
    // For the most part, all we have to do is just read and process what it sends us at face value.
    // Solenoid "normal" enable bits need to be monitored to ensure it isn't on for too long, and force shutdown if it is.
    // Solenoid "pulse" bits will borrow from current force feedback settings.
    // Rumble pulse bits are also something we do need to calculate ourselves.
    // The display (if enabled) is handled in the normal Core 0 gunmode run method.

