alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
    #ifdef USES_SOLENOID
      if(OF_Prefs::toggles[OF_Const::solenoid]) {
          // Solenoid "on" command
          if(serialQueue[SerialQueue_Solenoid]) {
              if(OF_FFB::GetSolenoid()) {
                  if(millis() - serialSolTimestamp > SERIAL_SOLENOID_MAXSHUTOFF) {
                      OF_FFB::SetSolenoid(LOW);
                      serialQueue[SerialQueue_Solenoid] = false;
                  }
              } else {
                  OF_FFB::SetSolenoid(HIGH);
                  serialSolTimestamp = millis();
              }
          // Solenoid "pulse" command
          } else if(serialQueue[SerialQueue_SolPulse]) {
              if(!serialSolPulsesLast) {                            // Have we started pulsing?
                  OF_FFB::SetSolenoid(HIGH);  // Start pulsing it on!
                  serialSolPulsesLast++;                                 // Start the sequence.
                  serialSolPulsesLastUpdate = millis();                  // timestamp
              } else if(serialSolPulsesLast <= serialSolPulses) {   // Have we met the pulses quota?
                  if(OF_FFB::GetSolenoid()) {
                      // custom hold length
                      if(serialSolCustomHoldLength) {
                          if(millis() - serialSolPulsesLastUpdate >= serialSolCustomHoldLength) {
                              OF_FFB::SetSolenoid(LOW);  // Start pulsing it off.
                              if(serialSolPulsesLast >= serialSolPulses)
                                  serialQueue[SerialQueue_SolPulse] = false;
                              else serialSolPulsesLast++, serialSolPulsesLastUpdate = millis();  // Timestamp our last pulse event.
                          }
                      // current settings hold length
                      } else if(millis() - serialSolPulsesLastUpdate >= OF_Prefs::settings[OF_Const::solenoidOnLength]) {
                          OF_FFB::SetSolenoid(LOW);  // Start pulsing it off.
                          if(serialSolPulsesLast >= serialSolPulses)
                              serialQueue[SerialQueue_SolPulse] = false;
                          else serialSolPulsesLast++, serialSolPulsesLastUpdate = millis();  // Timestamp our last pulse event.
                      }
                  } else {
                      // custom pause length
                      if(serialSolCustomPauseLength) {
                          if(millis() - serialSolPulsesLastUpdate >= serialSolCustomPauseLength) {
                              OF_FFB::SetSolenoid(HIGH); // Start pulsing it on.
                              serialSolPulsesLastUpdate = millis();          // Timestamp our last pulse event.
                          }
                      // current settings pause length
                      } else if(millis() - serialSolPulsesLastUpdate >=
                                OF_Prefs::settings[OF_Const::solenoidOffLength] << OF_FFB::autofireDoubleLengthWait ? 1 : 0) {
                          OF_FFB::SetSolenoid(HIGH); // Start pulsing it on.
                          serialSolPulsesLastUpdate = millis();          // Timestamp our last pulse event.
                      }
                  }
              }
          // Solenoid "off" command
          } else OF_FFB::SetSolenoid(LOW);
      // solenoid toggle not allowed, just force it off.
      } else OF_FFB::SetSolenoid(LOW);
  #endif // USES_SOLENOID

  #ifdef USES_RUMBLE
      if(OF_Prefs::toggles[OF_Const::rumble]) {
          // Rumble "on" command
          if(serialQueue[SerialQueue_Rumble]) {
              analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]); // turn/keep it on.
          // Rumble "pulse" command
          } else if(serialQueue[SerialQueue_RumbPulse]) {
              // Pulses start
              if(!serialRumbPulsesLast) {
                  if(serialRumbCustomHoldLength && serialRumbCustomPauseLength)
                       analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
                  else analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength] / 3);
                  serialRumbPulseStage = 0;                              // Set that we're at stage 0.
                  serialRumbPulsesLast++;
                  serialRumbPulsesLastUpdate = millis();
              // Pulses processing
              } else if(serialRumbPulsesLast <= serialRumbPulses) {
                  // G4IR-style on/off style ramping
                  if(serialRumbCustomHoldLength && serialRumbCustomPauseLength) {
                      if(!serialRumbPulseStage) {
                          if(millis() - serialRumbPulsesLastUpdate > serialRumbCustomHoldLength) {
                              serialRumbPulseStage = 0;
                              #ifdef ARDUINO_ARCH_ESP32
                                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0); // [ESP32_PORT] per ESP32
                              #else //rp2040
                              digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                              #endif
                              if(serialRumbPulsesLast >= serialRumbPulses)
                                  serialQueue[SerialQueue_RumbPulse] = false;
                          }
                      } else if(millis() - serialRumbPulsesLastUpdate > serialRumbCustomPauseLength) {
                          serialRumbPulseStage++;
                          analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
                      }
                  // OF-style analog ramping
                  } else if(millis() - serialRumbPulsesLastUpdate > serialRumbPulsesLength) { // have we waited enough time between pulse stages?
                      switch(serialRumbPulseStage) {
                          // Rising to Sustain
                          case 0:
                              analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
                              serialRumbPulseStage++;                    // Increments the stage of the pulse.
                              serialRumbPulsesLastUpdate = millis();     // and timestamps when we've had updated this last.
                              break;                                     // Then quits until next pulse stage
                          // Sustain to Falling
                          case 1:
                              analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength] / 2);
                              serialRumbPulseStage++;
                              serialRumbPulsesLastUpdate = millis();
                              break;
                          // Falloff
                          case 2:
                              analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength] / 3);
                              serialRumbPulseStage++;
                              serialRumbPulsesLastUpdate = millis();
                              break;
                          // Check
                          case 3:
                              if(serialRumbPulsesLast >= serialRumbPulses) {
                                  #ifdef ARDUINO_ARCH_ESP32
                                    analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0); // [ESP32_PORT] per ESP32
                                  #else //rp2040
                                  digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                                  #endif
                                  serialQueue[SerialQueue_RumbPulse] = false;
                              } else serialRumbPulsesLast++, serialRumbPulseStage = 0;
                              break;
                      }
                  }
              }
          // Rumble "off"
          } else 
                #ifdef ARDUINO_ARCH_ESP32
                    analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0); // [ESP32_PORT] per ESP32
                #else //rp2040
                    digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                #endif        
      // Rumble disabled, not allowed to be on
      } else 
                #ifdef ARDUINO_ARCH_ESP32
                    analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0); // [ESP32_PORT] per ESP32
                #else //rp2040
                    digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                #endif  
  #endif // USES_RUMBLE

  #ifdef LED_ENABLE
    if(serialLEDChange) {                                     // Has the LED command state changed?
        // LED "pulse" command
        if(serialQueue[SerialQueue_LEDPulse]) {
            // LED pulsing start
            if(!serialLEDPulsesLast) {                        // Are we just starting?
                serialQueue[SerialQueue_Red] = false, serialQueue[SerialQueue_Green] = false, serialQueue[SerialQueue_Blue] = false;
                serialLEDPulsesLast = 1;                           // Set that we have started.
                serialLEDPulseRising = true;                       // Set the LED cycle to rising.
                // Reset all the LEDs to zero, the color map will tell us which one to focus on.
                serialLEDR = 0, serialLEDG = 0, serialLEDB = 0;
            // LED pulsing processing
            } else if(serialLEDPulsesLast <= serialLEDPulses) {
                if(millis() - serialLEDPulsesLastUpdate > serialLEDPulsesLength) { // have we waited enough time between pulse stages?
                    switch(serialLEDPulseColorMap) {           // Check the color map
                        case 0b00000001:                       // Basically for R, G, or B,
                            if(serialLEDPulseRising) {
                                serialLEDR += 3;                   // Set the LED value up by three (it's easiest to do blindly like this without over/underflowing tbh)
                                if(serialLEDR == 255)       // If we've reached the max value,
                                    serialLEDPulseRising = false;  // Set that we're in the falling state now.
                            } else {
                                serialLEDR -= 3;                   // Decrement the value.
                                if(serialLEDR == 0) {         // If the LED value has reached the lowest point,
                                    serialLEDPulseRising = true;   // Set that we should be in the rising part of a new cycle.
                                    serialLEDPulsesLast++;         // This was a pulse cycle, so increment that.
                                }
                            }
                            serialLEDPulsesLastUpdate = millis(); // Timestamp this event.
                            break;                             // And get out.
                        case 0b00000010:
                            if(serialLEDPulseRising) {
                                serialLEDG += 3;
                                if(serialLEDG == 255)
                                    serialLEDPulseRising = false;
                            } else {
                                serialLEDG -= 3;
                                if(serialLEDG == 0) {
                                    serialLEDPulseRising = true;
                                    serialLEDPulsesLast++;
                                }
                            }
                            serialLEDPulsesLastUpdate = millis();
                            break;
                        case 0b00000100:
                            if(serialLEDPulseRising) {
                                serialLEDB += 3;
                                if(serialLEDB == 255)
                                    serialLEDPulseRising = false;
                            } else {
                                serialLEDB -= 3;
                                if(serialLEDB == 0) {
                                    serialLEDPulseRising = true;
                                    serialLEDPulsesLast++;
                                }
                            }
                            serialLEDPulsesLastUpdate = millis();
                            break;
                    }
                    // Then, commit the changed value.
                    OF_RGB::LedUpdate(serialLEDR, serialLEDG, serialLEDB);
                }
            // LED pulsing finishing
            } else serialLEDPulseColorMap = 0b00000000, serialQueue[SerialQueue_LEDPulse] = false;
        // Any LED static bits
        } else if(serialQueue[SerialQueue_Red] ||           // Are either the R,
                  serialQueue[SerialQueue_Green] ||         // G,
                  serialQueue[SerialQueue_Blue]) {          // OR B digital bits set to on?
            // Command the LED to change/turn on with the values serialProcessing set for us.
            OF_RGB::LedUpdate(serialLEDR, serialLEDG, serialLEDB);
            serialLEDChange = false;                               // Set the bit to off.
        // LEDs off
        } else OF_RGB::LedOff(), serialLEDChange = false;     // We've done the change, so set it off to reduce redundant LED updates.
    }
    #endif // LED_ENABLE
}
#endif // MAMEHOOKER

// ==================== FINE CODICE PER MAMEHOOKER =======================================

// ===== Desktop App framed serial protocol ===================================

