alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
// Pin map that was active before an App commit started. It is needed because
// OF_Prefs::pins is overwritten by incoming records before PinsReset() runs.
static int8_t appSerialPinsBeforeCommit[OF_Const::boardInputsCount] = {};
static bool appSerialPinsBeforeCommitValid = false;

uint8_t OF_Serial::AppSerialCRC8(const uint8_t *data, uint16_t length)
{
    uint8_t crc = 0;

    while(length--) {
        crc ^= *data++;
        for(uint8_t bit = 0; bit < 8; ++bit)
            crc = (crc & 0x80) ? (uint8_t)((crc << 1) ^ 0x9B) : (uint8_t)(crc << 1);
    }

    return crc;
}

uint8_t OF_Serial::AppSerialNextSequence()
{
    ++appSerialTxSequence;
    if(appSerialTxSequence == 0)
        appSerialTxSequence = 1;

    return appSerialTxSequence;
}

void OF_Serial::AppSerialSessionBegin()
{
    appSerialSessionActive = true;
    appSerialRxLength = 0;
    appSerialRxTimestamp = 0;
    appSerialTxSequence = 0;
    appSerialRawDockState[0] = appSerialRawDockState[1] = 0;
    appSerialLastRxValid = false;
    appSerialCommitActive = false;
    appSerialCommitFailed = false;
    appSerialCalibrationCancel = false;
    // A new serial session must not discard RAM awaiting a successful save.
    FW_Common::dockedSaving = appSerialPinsBeforeCommitValid;

    appSerialWaitingForAck = false;
    appSerialDispatching = false;
    appSerialProcessingDeferred = false;
    appSerialDeferredValid = false;

    appSerialRxClean = true;
    appSerialRedockRequested = false;
    appSerialSessionConfirmed = false;
    ++appSerialSessionCounter;
}

void OF_Serial::AppSerialSessionEnd()
{
    appSerialSessionActive = false;
    appSerialRxLength = 0;
    appSerialRxTimestamp = 0;
    appSerialRawDockState[0] = appSerialRawDockState[1] = 0;
    appSerialLastRxValid = false;
    appSerialCommitActive = false;
    appSerialCommitFailed = false;
    appSerialCalibrationCancel = false;
    FW_Common::dockedSaving = appSerialPinsBeforeCommitValid;

    appSerialWaitingForAck = false;
    appSerialDeferredValid = false;

    appSerialRxClean = true;
    appSerialRedockRequested = false;
}

void OF_Serial::AppSerialEnterDockedMode(WebAppLink link)
{
    WebAppSerial::Use(link);
    AppSerialSessionBegin();

    #if /*defined(ARDUINO_ARCH_RP2040) &&*/ defined(DUAL_CORE) // This may be being run from Core 1, so signal if running in main Run Mode.
    if(FW_Common::gunMode == FW_Const::GunMode_Run) {
        #ifdef ARDUINO_ARCH_ESP32
        esp32_fifo.push(FW_Const::GunMode_Docked);
        esp32_fifo.pop();
        #else //rp2040
        rp2040.fifo.push(FW_Const::GunMode_Docked);
        rp2040.fifo.pop();
        #endif
    }
    else FW_Common::SetMode(FW_Const::GunMode_Docked);
    #else
    FW_Common::SetMode(FW_Const::GunMode_Docked);
    #endif // DUAL_CORE
}

void OF_Serial::AppSerialAbandonSession()
{
    appSerialRedockRequested = false;

    if(!appSerialSessionActive)
        return;

    if(FW_Common::gunMode == FW_Const::GunMode_Calibration ||
       FW_Common::gunMode == FW_Const::GunMode_Verification) {
        // Same as a full disconnect received during calibration: ExecCalMode()
        // consumes the cancel request and restores the backed-up profile, then
        // the sCaliProfile dispatch ends the session and restores Run mode.
        appSerialCalibrationCancel = true;
        appSerialSessionActive = false;
        return;
    }

    appSerialCommitActive = false;
    appSerialCommitFailed = false;
    AppSerialSessionEnd();

    // With a partly transferred configuration stay Docked (as after FE FE FE):
    // the next App session is told to save again.
    if(!appSerialPinsBeforeCommitValid)
        AppSerialRestoreRunState();
}

void OF_Serial::AppSerialEndUnansweredSession()
{
    if(appSerialSessionActive && !appSerialSessionConfirmed)
        AppSerialAbandonSession();
}

bool OF_Serial::AppSerialTakeLinkLost()
{
    // Always consumed: a page closing while the App uses the serial link is irrelevant.
    const bool lost = WebApp_TakeClientLost();
    return lost && appSerialSessionActive && WebAppSerial::IsWebSocket();
}

bool OF_Serial::AppSerialWebDockPending()
{
    return WebAppSerial::Ops(WebAppLink::WebSocket).available() > 0 || WebApp_ClientLostPending();
}

bool OF_Serial::AppSerialInputPending()
{
    if(WebAppSerial::available() > 0)
        return true;
    if(WebAppSerial::Ops(WebAppLink::SerialPort).available() > 0)
        return true;
    return OF_WebConfigModeActive && AppSerialWebDockPending();
}

bool OF_Serial::AppSerialPollDock(WebAppLink link)
{
    if(link == WebAppLink::WebSocket && !OF_WebConfigModeActive)
        return false;

    const OF_WebSerialWrapper::SerialOps &stream = WebAppSerial::Ops(link);
    const uint8_t index = link == WebAppLink::WebSocket ? 1 : 0;

    if(appSerialSessionActive) {
        // One App at a time: discard what arrives on the other link (its dock
        // retries must not start a stale session when this one ends).
        if(link != WebAppSerial::link) {
            while(stream.available() > 0 && stream.read() >= 0) {}
            appSerialRawDockState[index] = 0;
        }
        return false;
    }

    if(appSerialRawDockState[index] != 0 &&
       millis() - appSerialRawDockTimestamp[index] > APP_SERIAL_FRAME_TIMEOUT)
        appSerialRawDockState[index] = 0;

    while(stream.available() > 0) {
        const int incoming = stream.read();
        if(incoming < 0)
            return false;

        if(appSerialRawDockState[index] != 0 && incoming == OF_Const::sDock2) {
            appSerialRawDockState[index] = 0;
            AppSerialEnterDockedMode(link);
            return true;
        }

        appSerialRawDockState[index] = incoming == OF_Const::sDock1 ? 1 : 0;
        if(appSerialRawDockState[index] != 0)
            appSerialRawDockTimestamp[index] = millis();
    }
    return false;
}

void OF_Serial::SerialProcessingWebDock()
{
    // A page that disconnected while no App was docked has no session to end.
    if(!appSerialSessionActive)
        WebApp_TakeClientLost();

    AppSerialPollDock(WebAppLink::WebSocket);
}

bool OF_Serial::AppSerialWriteFrame(uint8_t typeFlags, uint8_t command, uint8_t sequence, const void *payload, uint8_t length)
{
    if(length > APP_SERIAL_MAX_PAYLOAD || (length > 0 && payload == nullptr))
        return false;

    appSerialTxBuffer[0] = APP_SERIAL_START_1;
    appSerialTxBuffer[1] = APP_SERIAL_START_2;
    appSerialTxBuffer[2] = typeFlags;
    appSerialTxBuffer[3] = command;
    appSerialTxBuffer[4] = sequence;
    appSerialTxBuffer[5] = length;

    if(length > 0)
        memcpy(&appSerialTxBuffer[6], payload, length);

    appSerialTxBuffer[6 + length] = AppSerialCRC8(&appSerialTxBuffer[2], (uint16_t)(4 + length));
    const uint16_t frameLength = (uint16_t)(APP_SERIAL_OVERHEAD + length);

    const bool written = WebAppSerial::write(appSerialTxBuffer, frameLength) == frameLength;

    // Reliable frames are followed immediately by a wait for the peer's ACK.
    // Push them out now instead of relying on the USB/serial buffer latency.
    // Best-effort real-time events deliberately remain non-blocking.
    if(written && (typeFlags & APP_SERIAL_TYPE_MASK) != APP_SERIAL_TYPE_EVENT)
        WebAppSerial::flush();

    return written;
}

