alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
void OF_Serial::AppSerialSendAck(uint8_t command, uint8_t sequence)
{
    AppSerialWriteFrame(APP_SERIAL_TYPE_ACK, command, sequence, nullptr, 0);
}

bool OF_Serial::AppSerialReadFrame(AppSerialFrame_s &frame)
{
    if(appSerialRxLength > 0 && millis() - appSerialRxTimestamp > APP_SERIAL_FRAME_TIMEOUT) {
        appSerialRxLength = 0;
        appSerialRxClean = true;
    }

    for(;;) {
        while(appSerialRxLength >= 2) {
            uint16_t start = 0;
            while(start + 1 < appSerialRxLength &&
                  (appSerialRxBuffer[start] != APP_SERIAL_START_1 || appSerialRxBuffer[start + 1] != APP_SERIAL_START_2))
                ++start;

            if(start + 1 >= appSerialRxLength) {
                // A new App docking on this link while the previous session is
                // still active (page reload, App restarted): the raw handshake
                // must start exactly on a clean frame boundary, and the current
                // App must already have answered (else it is its own dock retry).
                if(appSerialSessionActive && appSerialSessionConfirmed &&
                   appSerialRxClean && appSerialRxLength == 2 &&
                   appSerialRxBuffer[0] == OF_Const::sDock1 &&
                   appSerialRxBuffer[1] == OF_Const::sDock2) {
                    appSerialRxLength = 0;
                    appSerialRedockRequested = true;
                    return false;
                }

                if(appSerialRxBuffer[appSerialRxLength - 1] == APP_SERIAL_START_1) {
                    appSerialRxBuffer[0] = APP_SERIAL_START_1;
                    appSerialRxLength = 1;
                } else appSerialRxLength = 0;
                appSerialRxClean = false;
                break;
            }

            if(start > 0) {
                memmove(appSerialRxBuffer, &appSerialRxBuffer[start], appSerialRxLength - start);
                appSerialRxLength -= start;
                appSerialRxClean = false;
            }

            if(appSerialRxLength < 6)
                break;

            const uint8_t typeFlags = appSerialRxBuffer[2];
            const uint8_t type = typeFlags & APP_SERIAL_TYPE_MASK;
            const uint8_t sequence = appSerialRxBuffer[4];
            const uint8_t length = appSerialRxBuffer[5];
            const bool invalidFlags = (typeFlags & (uint8_t)~(APP_SERIAL_TYPE_MASK | APP_SERIAL_FLAG_FINAL)) != 0;
            const bool invalidFinal = (typeFlags & APP_SERIAL_FLAG_FINAL) &&
                                      (type != APP_SERIAL_TYPE_RESPONSE || length != 0);
            const bool invalidSequence = (type == APP_SERIAL_TYPE_EVENT) ? (sequence != 0) : (sequence == 0);
            const bool invalidAck = type == APP_SERIAL_TYPE_ACK && length != 0;

            if(invalidFlags || invalidFinal || invalidSequence || invalidAck || length > APP_SERIAL_MAX_PAYLOAD) {
                memmove(appSerialRxBuffer, &appSerialRxBuffer[1], --appSerialRxLength);
                appSerialRxClean = false;
                continue;
            }

            const uint16_t frameLength = (uint16_t)(APP_SERIAL_OVERHEAD + length);
            if(appSerialRxLength < frameLength)
                break;

            const uint8_t receivedCRC = appSerialRxBuffer[6 + length];
            const uint8_t calculatedCRC = AppSerialCRC8(&appSerialRxBuffer[2], (uint16_t)(4 + length));
            if(receivedCRC != calculatedCRC) {
                memmove(appSerialRxBuffer, &appSerialRxBuffer[1], --appSerialRxLength);
                appSerialRxClean = false;
                continue;
            }

            frame.typeFlags = typeFlags;
            frame.command = appSerialRxBuffer[3];
            frame.sequence = sequence;
            frame.length = length;
            frame.crc = receivedCRC;
            if(length > 0)
                memcpy(frame.payload, &appSerialRxBuffer[6], length);

            appSerialRxLength -= frameLength;
            if(appSerialRxLength > 0)
                memmove(appSerialRxBuffer, &appSerialRxBuffer[frameLength], appSerialRxLength);

            appSerialRxClean = true;
            if(appSerialSessionActive)
                appSerialSessionConfirmed = true;
            return true;
        }

        if(!WebAppSerial::available())
            return false;

        const int incoming = WebAppSerial::read();
        if(incoming < 0)
            return false;

        if(appSerialRxLength >= APP_SERIAL_MAX_FRAME) {
            memmove(appSerialRxBuffer, &appSerialRxBuffer[1], APP_SERIAL_MAX_FRAME - 1);
            appSerialRxLength = APP_SERIAL_MAX_FRAME - 1;
            appSerialRxClean = false;
        }

        appSerialRxBuffer[appSerialRxLength++] = (uint8_t)incoming;
        appSerialRxTimestamp = millis();
    }
}

bool OF_Serial::AppSerialRequestMatchesLast(const AppSerialFrame_s &frame)
{
    return appSerialLastRxValid &&
           appSerialLastRxCommand == frame.command &&
           appSerialLastRxSequence == frame.sequence &&
           appSerialLastRxLength == frame.length &&
           appSerialLastRxCRC == frame.crc;
}

void OF_Serial::AppSerialProcessDeferredRequest()
{
    if(appSerialWaitingForAck ||
       appSerialDispatching ||
       appSerialProcessingDeferred)
        return;

    appSerialProcessingDeferred = true;

    while(appSerialSessionActive &&
          appSerialDeferredValid &&
          !appSerialWaitingForAck) {
        const AppSerialFrame_s frame = appSerialDeferredFrame;
        appSerialDeferredValid = false;
        AppSerialHandleFrame(frame);
    }

    appSerialProcessingDeferred = false;
}

void OF_Serial::AppSerialHandleFrame(const AppSerialFrame_s &frame)
{
    const uint8_t type = frame.typeFlags & APP_SERIAL_TYPE_MASK;

    if(type != APP_SERIAL_TYPE_REQUEST)
        return;

    const bool duplicate = AppSerialRequestMatchesLast(frame);

    if(!duplicate) {
        appSerialLastRxValid = true;
        appSerialLastRxCommand = frame.command;
        appSerialLastRxSequence = frame.sequence;
        appSerialLastRxLength = frame.length;
        appSerialLastRxCRC = frame.crc;
    }

    // The complete request frame has been received and validated.
    AppSerialSendAck(frame.command, frame.sequence);

    if(!duplicate) {
        const bool alreadyDispatching = appSerialDispatching;
        appSerialDispatching = true;
        AppSerialDispatchRequest(frame);
        appSerialDispatching = alreadyDispatching;
    }

    AppSerialProcessDeferredRequest();
}

bool OF_Serial::AppSerialSendReliable(uint8_t typeFlags,
                                      uint8_t command,
                                      const void *payload,
                                      uint8_t length,
                                      uint8_t sequence)
{
    if(!appSerialSessionActive || length > APP_SERIAL_MAX_PAYLOAD)
        return false;

    // Single-result commit replies echo the request sequence. Other response
    // streams retain their independent per-frame sequence, as before.
    if(sequence == 0)
        sequence = AppSerialNextSequence();

    bool success = false;

    appSerialWaitingForAck = true;

    for(uint8_t attempt = 0;
        attempt <= APP_SERIAL_MAX_RETRIES &&
        appSerialSessionActive &&
        !success;
        ++attempt) {
        if(!AppSerialWriteFrame(typeFlags,
                                command,
                                sequence,
                                payload,
                                length))
            break;

        const unsigned long started = millis();

        while(appSerialSessionActive &&
              millis() - started < APP_SERIAL_ACK_TIMEOUT &&
              !success) {
            AppSerialFrame_s frame;

            while(AppSerialReadFrame(frame)) {
                const uint8_t type =
                    frame.typeFlags & APP_SERIAL_TYPE_MASK;

                if(type == APP_SERIAL_TYPE_ACK) {
                    if(frame.command == command &&
                       frame.sequence == sequence) {
                        success = true;
                        break;
                    }

                    continue;
                }

