alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
                if(type == APP_SERIAL_TYPE_REQUEST) {
                    if(AppSerialRequestMatchesLast(frame)) {
                        // The App is retrying the request whose response is
                        // currently waiting for confirmation.
                        AppSerialSendAck(frame.command, frame.sequence);
                    } else {
                        // A following valid request proves that the stop-and-
                        // wait peer has advanced beyond this response. Retain
                        // the request, complete this send and dispatch it after
                        // unwinding the current command.
                        if(!appSerialDeferredValid) {
                            appSerialDeferredFrame = frame;
                            appSerialDeferredValid = true;
                        }

                        success = true;
                        break;
                    }
                }
            }

            // The App that owned this session is gone: stop waiting for its ACK.
            if(!success && (appSerialRedockRequested || AppSerialTakeLinkLost())) {
                AppSerialAbandonSession();
                break;
            }

            if(!success)
                yield();
        }
    }

    appSerialWaitingForAck = false;

    if(!appSerialDispatching)
        AppSerialProcessDeferredRequest();

    return success;
}

bool OF_Serial::AppSerialSendResponse(uint8_t command,
                                      const void *payload,
                                      uint8_t length,
                                      bool final)
{
    if(final && length != 0)
        return false;

    const uint8_t typeFlags =
        APP_SERIAL_TYPE_RESPONSE |
        (final ? APP_SERIAL_FLAG_FINAL : 0);

    return AppSerialSendReliable(typeFlags, command, payload, length);
}

bool OF_Serial::AppSerialSendEvent(uint8_t command, const void *payload, uint8_t length)
{
    if(!appSerialSessionActive)
        return false;

    return AppSerialWriteFrame(APP_SERIAL_TYPE_EVENT, command, 0, payload, length);
}

void OF_Serial::AppSerialSendError(uint8_t error)
{
    if(error)
        AppSerialSendResponse(OF_Const::sError, &error, 1);
    else AppSerialSendResponse(OF_Const::sError);
}

void OF_Serial::AppSerialSendCommitError(const AppSerialFrame_s &frame)
{
    const uint8_t payload[] = {APP_SERIAL_ERR_COMMIT_RETRY, frame.command};
    AppSerialSendReliable(APP_SERIAL_TYPE_RESPONSE,
                          OF_Const::sError,
                          payload,
                          sizeof(payload),
                          frame.sequence);
}

bool OF_Serial::AppSerialTakeCalibrationCancel()
{
    const bool requested = appSerialCalibrationCancel;
    appSerialCalibrationCancel = false;
    return requested;
}

// Serial Buffer in Docked Mode should always be read by the main core on multicore systems.
void OF_Serial::SerialProcessingDocked()
{
    const bool calibrating =
        FW_Common::gunMode == FW_Const::GunMode_Calibration ||
        FW_Common::gunMode == FW_Const::GunMode_Verification;

    // The WebSocket page of the current session closed or was replaced.
    if(AppSerialTakeLinkLost())
        AppSerialAbandonSession();

    // ExecCalMode() is still inside the dispatch of the calibration command.
    // A request received while a calibration response is waiting for its ACK
    // is deferred, so process it explicitly at the next calibration poll.
    if(appSerialSessionActive &&
       appSerialDeferredValid &&
       !appSerialWaitingForAck &&
       (FW_Common::gunMode == FW_Const::GunMode_Calibration ||
        FW_Common::gunMode == FW_Const::GunMode_Verification)) {
        const AppSerialFrame_s deferredFrame = appSerialDeferredFrame;

        appSerialDeferredValid = false;
        AppSerialHandleFrame(deferredFrame);

        if(!appSerialSessionActive)
            return;
    }

    // The two-byte docking handshake intentionally remains unframed. Once it
    // succeeds, every App byte in both directions uses the framed protocol.
    // No new session can start until an abandoned calibration has been unwound.
    // Without a session both links are listened to (web configuration mode).
    if(!appSerialSessionActive && !calibrating) {
        if(!AppSerialPollDock(WebAppLink::SerialPort))
            AppSerialPollDock(WebAppLink::WebSocket);
    } else if(appSerialSessionActive) {
        AppSerialPollDock(WebAppSerial::IsWebSocket() ? WebAppLink::SerialPort : WebAppLink::WebSocket);
    }

    if(appSerialSessionActive) {
        AppSerialFrame_s frame;
        while(appSerialSessionActive && AppSerialReadFrame(frame))
            AppSerialHandleFrame(frame);
    }

    // A new App sent the raw dock handshake over an active session: the old App
    // is gone. End its session; the App's next dock retry starts a new one.
    if(appSerialRedockRequested)
        AppSerialAbandonSession();
}

bool OF_Serial::AppSerialDispatchCommit(const AppSerialFrame_s &frame,
                                        bool fullDisconnect)
{
    // A new commit also restarts an interrupted attempt.
    // Preserve the calibration data and the original hardware pin map
    // until the complete configuration has been saved successfully.
    if(frame.command == OF_Const::sCommitStart) {
        if(!appSerialPinsBeforeCommitValid) {
            memcpy(appSerialPinsBeforeCommit,
                   OF_Prefs::pins,
                   sizeof(appSerialPinsBeforeCommit));

            appSerialPinsBeforeCommitValid = true;
            FW_Common::buttons.Unset();
        }

        // Start the new transfer from the board defaults.
        // The App subsequently overwrites the custom pins, when enabled,
        // and always transmits the complete button mapping.
        OF_Prefs::LoadPresets();

        FW_Common::dockedSaving = true;
        appSerialCommitActive = true;
        appSerialCommitFailed = false;

        if(!AppSerialSendReliable(APP_SERIAL_TYPE_RESPONSE,
                                  frame.command,
                                  nullptr,
                                  0,
                                  frame.sequence)) {
            // Keep the received data and original hardware pin map so that
            // the App can start another complete transfer.
            appSerialCommitActive = false;
        }

