alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
        return true;
    }

    // Explicit reset commands remain available even if a transfer stopped.
    if(!appSerialCommitActive ||
       frame.command == OF_Const::sClearFlash ||
       frame.command == OF_Const::sRebootToBootloader)
        return false;

    switch(frame.command) {
        case OF_Const::sSave: {
            const bool complete = !appSerialCommitFailed;

            const bool saved =
                complete &&
                FW_Common::SavePreferences() == OF_Prefs::Error_Success;

            if(saved) {
                // Deinitialize the hardware using the pin map that was active
                // before the configuration transfer.
                FW_Common::PinsReset(appSerialPinsBeforeCommit);

                // Apply all newly saved runtime settings.
                FW_Common::CameraSet();
                FW_Common::SetMode(FW_Common::gunMode); // Riallineamento Square Advanced dopo il salvataggio. Con USE_SQUARE_ADVANCED disabilitato è praticamente ininfluente.
                FW_Common::FeedbackSet();
                FW_Common::UpdateBindings(true);

                #ifdef LED_ENABLE
                if(FW_Common::gunMode == FW_Const::GunMode_Docked) {
                    OF_RGB::LedUpdate(127, 127, 255);
                } else if(FW_Common::gunMode == FW_Const::GunMode_Pause) {
                    OF_RGB::SetLedPackedColor(
                        OF_Prefs::profiles[
                            OF_Prefs::currentProfile
                        ].color);
                }
                #endif // LED_ENABLE

                FW_Common::buttons.Begin();

                appSerialPinsBeforeCommitValid = false;
                FW_Common::dockedSaving = false;
            }

            // On failure, retain the configuration in RAM, the original
            // hardware pin map and the recovery guard for another attempt.
            appSerialCommitActive = false;

            static const char successText[] =
                " (Successfully saved to LittleFS Storage)";
            static const char failureText[] =
                " (Failed to save to LittleFS Storage)";

            const char *text = saved ? successText : failureText;
            const uint8_t textLength = (uint8_t)strlen(text);

            uint8_t payload[1 + sizeof(successText)];
            payload[0] = saved;
            memcpy(&payload[1], text, textLength);

            AppSerialSendReliable(APP_SERIAL_TYPE_RESPONSE,
                                  OF_Const::sSave,
                                  payload,
                                  (uint8_t)(1 + textLength),
                                  frame.sequence);

            #ifdef USES_DISPLAY
            // SavePreferences() skips its visual effects during an App commit.
            // Send the result before holding the OLED message so that the
            // display delay does not extend the App response time.
            if(FW_Common::OLED.display != nullptr) {
                FW_Common::OLED.ScreenModeChange(
                    saved ? ExtDisplay::Screen_SaveSuccess :
                            ExtDisplay::Screen_SaveError);

                // Same duration as the original save feedback patterns.
                delay(saved ? 285 : 410);
                FW_Common::RedrawDisplay();
            }
            #endif // USES_DISPLAY

            break;
        }

        case OF_Const::serialTerminator: {
            // End only this attempt: never reload flash over unsaved calibration.
            appSerialCommitActive = false;
            appSerialCommitFailed = false;

            AppSerialSendResponse(OF_Const::serialTerminator, nullptr, 0, true);
            if(fullDisconnect)
                AppSerialSessionEnd(); // Stay Docked with pending RAM.
            break;
        }

        case OF_Const::sCommitID:
            if(frame.length == sizeof(OF_Prefs::USBMap_t))
                memcpy(&OF_Prefs::usb, frame.payload, sizeof(OF_Prefs::USBMap_t));
            else appSerialCommitFailed = true;
            break;

        case OF_Const::sCommitToggles:
            if(!AppSerialReceiveRecord(frame.payload, frame.length,
                                       OF_Prefs::toggles,
                                       OF_Prefs::OFPresets.boolTypes_Strings,
                                       sizeof(OF_Prefs::toggles) / OF_Const::boolTypesCount))
                appSerialCommitFailed = true;
            break;

        case OF_Const::sCommitPins:
            if(!AppSerialReceiveRecord(frame.payload, frame.length,
                                       OF_Prefs::pins,
                                       OF_Prefs::OFPresets.boardInputs_Strings,
                                       sizeof(OF_Prefs::pins) / OF_Const::boardInputsCount))
                appSerialCommitFailed = true;
            break;

        case OF_Const::sCommitSettings:
            if(!AppSerialReceiveRecord(frame.payload, frame.length,
                                       OF_Prefs::settings,
                                       OF_Prefs::OFPresets.settingsTypes_Strings,
                                       sizeof(OF_Prefs::settings) / OF_Const::settingsTypesCount))
                appSerialCommitFailed = true;
            break;

        case OF_Const::sCommitBtns:
            if(!AppSerialReceiveRecord(frame.payload, frame.length,
                                       OF_Prefs::backupButtonDesc,
                                       OF_Prefs::OFPresets.boardInputs_Strings,
                                       sizeof(OF_Prefs::backupButtonDesc) / ButtonCount))
                appSerialCommitFailed = true;
            break;

        case OF_Const::sCommitProfile:
            if(!AppSerialReceiveRecord(frame.payload, frame.length,
                                       OF_Prefs::profiles,
                                       OF_Prefs::OFPresets.profSettingTypes_Strings,
                                       sizeof(uint32_t),
                                       true))
                appSerialCommitFailed = true;
            break;

        default:
            appSerialCommitFailed = true;
            appSerialCommitActive = false;
            AppSerialSendCommitError(frame);
            break;
    }

