alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
    return true;
}

void OF_Serial::AppSerialRestoreRunState()
{
    if(!FW_Common::justBooted)
        FW_Common::SetMode(FW_Const::GunMode_Run);
    else
        FW_Common::SetMode(FW_Const::GunMode_Init);

    FW_Common::SetRunMode(
        (FW_Const::RunMode_e)
        OF_Prefs::profiles[OF_Prefs::currentProfile].runMode);
}

void OF_Serial::AppSerialDispatchRequest(const AppSerialFrame_s &frame)
{
    const bool fullDisconnect =
        frame.command == OF_Const::serialTerminator &&
        frame.length == 2 &&
        frame.payload[0] == OF_Const::serialTerminator &&
        frame.payload[1] == OF_Const::serialTerminator;

    // Keep the profile stable until ExecCalMode() has restored or accepted it.
    if((FW_Common::gunMode == FW_Const::GunMode_Calibration ||
        FW_Common::gunMode == FW_Const::GunMode_Verification) &&
       frame.command != OF_Const::serialTerminator) {
        appSerialCalibrationCancel = true;
        AppSerialSendError();
        return;
    }

    if(AppSerialDispatchCommit(frame, fullDisconnect))
        return;

    // Do not use hardware with a partly updated configuration.
    if(appSerialPinsBeforeCommitValid) {
        switch(frame.command) {
        case OF_Const::sGetToggles:
        case OF_Const::sGetPins:
        case OF_Const::sGetSettings:
        case OF_Const::sGetBtns:
        case OF_Const::sGetProfile:
        case OF_Const::serialTerminator:
        case OF_Const::sClearFlash:
        case OF_Const::sRebootToBootloader:
            break;

        default:
            AppSerialSendCommitError(frame);
            return;
        }
    }

    switch(frame.command) {  

    case OF_Const::serialTerminator:
        if(FW_Common::gunMode == FW_Const::GunMode_Calibration ||
           FW_Common::gunMode == FW_Const::GunMode_Verification) {
            appSerialCalibrationCancel = true;

            // ExecCalMode() must consume the cancellation flag before
            // AppSerialSessionEnd() clears it.
            if(fullDisconnect) {
                AppSerialSendResponse(OF_Const::serialTerminator,
                                      nullptr,
                                      0,
                                      true);

                // Do not call AppSerialSessionEnd() here: it would clear
                // appSerialCalibrationCancel before ExecCalMode() consumes it.
                appSerialSessionActive = false;
            }

            break;
        }

        // A cancel can cross a calibration End already confirmed by trigger.
        // Only the explicit FE FE FE request disconnects an idle session.
        if(!fullDisconnect)
            break;

        AppSerialSendResponse(OF_Const::serialTerminator,
                              nullptr,
                              0,
                              true);

        AppSerialSessionEnd();

        if(appSerialPinsBeforeCommitValid)
            break; // Do not run with pending, partly updated configuration.

        AppSerialRestoreRunState();

        break;

    case OF_Const::sGetToggles:
        AppSerialSendRecords(frame.command, OF_Prefs::toggles,
                             OF_Prefs::OFPresets.boolTypes_Strings,
                             sizeof(OF_Prefs::toggles) / OF_Const::boolTypesCount);
        break;

    case OF_Const::sGetPins:
        AppSerialSendRecords(frame.command, OF_Prefs::pins,
                             OF_Prefs::OFPresets.boardInputs_Strings,
                             sizeof(OF_Prefs::pins) / OF_Const::boardInputsCount);
        break;

    case OF_Const::sGetSettings:
        AppSerialSendRecords(frame.command, OF_Prefs::settings,
                             OF_Prefs::OFPresets.settingsTypes_Strings,
                             sizeof(OF_Prefs::settings) / OF_Const::settingsTypesCount);
        break;

    case OF_Const::sGetBtns:
        AppSerialSendRecords(frame.command, OF_Prefs::backupButtonDesc,
                             OF_Prefs::OFPresets.boardInputs_Strings,
                             sizeof(OF_Prefs::backupButtonDesc) / ButtonCount);
        break;

    case OF_Const::sGetProfile:
    {
        bool sent = true;
        for(int prof = 0; prof < PROFILE_COUNT && sent; ++prof)
            sent = AppSerialSendRecords(frame.command,
                                        &OF_Prefs::profiles[prof],
                                        OF_Prefs::OFPresets.profSettingTypes_Strings,
                                        sizeof(uint32_t),
                                        prof,
                                        false);
        if(sent && AppSerialSendResponse(frame.command, nullptr, 0, true) &&
           appSerialPinsBeforeCommitValid)
            AppSerialSendCommitError(frame); // A reconnected App must save again.
        break;
    }

    case OF_Const::sIRTest:
        // Leaving test mode is always accepted, also when the camera stopped working
        // while testing: the App would otherwise report the camera error twice.
        if(frame.payload[0] && FW_Common::camNotAvailable) {
            AppSerialSendError(OF_Const::sErrCam);
        } else if(frame.payload[0]) {
            FW_Common::SetRunMode(FW_Const::RunMode_Processing);
        } else if(FW_Common::runMode == FW_Const::RunMode_Processing) {
            switch(OF_Prefs::profiles[OF_Prefs::currentProfile].runMode) {
            case FW_Const::RunMode_Normal:
                FW_Common::SetRunMode(FW_Const::RunMode_Normal);
                break;

            case FW_Const::RunMode_Average:
                FW_Common::SetRunMode(FW_Const::RunMode_Average);
                break;

            case FW_Const::RunMode_Average2:
                FW_Common::SetRunMode(FW_Const::RunMode_Average2);
                break;
            }
        }
        break;

    case OF_Const::sCaliProfile: {
        const uint8_t operation = frame.payload[0];
        const uint8_t profile = frame.payload[1];

        FW_Common::SelectCalProfile(profile);

        const uint8_t currentProfile = OF_Prefs::currentProfile;

        if(!AppSerialSendResponse(
                OF_Const::sCurrentProf,
                &currentProfile,
                sizeof(currentProfile))) {
            AppSerialSendError();
            break;
        }

        switch(operation) {
        case OF_Const::sCaliProfile:
            // When used inside the payload, sCaliProfile means:
            // select the requested profile without starting calibration.
            break;

        case OF_Const::sCaliStart:
            if(FW_Common::camNotAvailable) {
                AppSerialSendError(OF_Const::sErrCam);
            } else {
                const uint8_t caliSettings = frame.payload[2];

                FW_Common::SetIrSensitivity(caliSettings & 0x0F);
                FW_Common::SetIrLayout(caliSettings >> 4);
                FW_Common::SetMode(FW_Const::GunMode_Calibration);
                FW_Common::ExecCalMode(true);

                // A full App disconnect received inside ExecCalMode()
                // first cancels calibration so that the backed-up profile
                // is restored, then completes the normal undock here.
                if(!appSerialSessionActive) {
                    AppSerialSessionEnd();
                    AppSerialRestoreRunState();
                }
            }
            break;
        }
        break;
    }

    #ifdef USES_SOLENOID
    case OF_Const::sTestSolenoid:
        OF_FFB::SetSolenoid(HIGH);
        delay(OF_Prefs::settings[OF_Const::solenoidOnLength]);
        OF_FFB::SetSolenoid(LOW);
        break;
    #endif

    #ifdef USES_RUMBLE
    case OF_Const::sTestRumble:
        // The App enables the test from its unsaved toggle: the saved map may have no rumble pin.
        if(OF_Prefs::pins[OF_Const::rumblePin] < 0)
            break;
        analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
        delay(OF_Prefs::settings[OF_Const::rumbleInterval]);
        #ifdef ARDUINO_ARCH_ESP32
        analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0);
        #else
        digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
        #endif
        break;
    #endif

    #ifdef LED_ENABLE
    case OF_Const::sTestLEDR:
        OF_RGB::LedUpdate(255, 0, 0);
        break;
    case OF_Const::sTestLEDG:
        OF_RGB::LedUpdate(0, 255, 0);
        break;
    case OF_Const::sTestLEDB:
        OF_RGB::LedUpdate(0, 0, 255);
        break;
    #endif

    case OF_Const::sClearFlash:
        OF_Prefs::ResetPreferences();
        WebAppSerial::flush();
        #ifdef ARDUINO_ARCH_ESP32
            #ifdef OPENFIRE_WIRELESS_ENABLE
            if(TinyUSBDevices.onBattery) {
                // The dongle reset notification can be added separately.
            }
            #endif
            //esp_restart();
            esp_rom_software_reset_system();
        #else
            rp2040.reboot();
        #endif
        break;

    case OF_Const::sRebootToBootloader:
        WebAppSerial::flush();
        FW_Common::RebootToBootloader();
        break;

    default:
        break;
    }
}

