alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
bool OF_Serial::AppSerialSendRecords(uint8_t command,
                                     const void *data,
                                     const std::unordered_map<std::string_view, int> &fields,
                                     size_t dataSize,
                                     int profile,
                                     bool sendFinal)
{
    uint8_t payload[APP_SERIAL_MAX_PAYLOAD];

    const bool profileData = profile >= 0;
    const bool buttonData = data == OF_Prefs::backupButtonDesc;

    for(const auto &pair : fields) {
        if(pair.second < 0)
            continue;

        // CurrentProf belongs to the complete profile set and must therefore
        // be transmitted only once, together with the first profile.
        if(profileData &&
           pair.second == OF_Const::profCurrent &&
           profile != 0)
            continue;

        const size_t nameLength = pair.first.length();
        size_t pos = nameLength + 1;

        // Space for the field name, its terminator and the record metadata.
        if(pos + 2 > sizeof(payload)) {
            AppSerialSendError();
            return false;
        }

        memcpy(payload, pair.first.data(), nameLength);
        payload[nameLength] = '\0';

        if(profileData) {
            if(pair.second == OF_Const::profCurrent) {
                payload[pos++] = (uint8_t)sizeof(uint8_t);
                payload[pos++] = (uint8_t)OF_Prefs::currentProfile;
            } else {
                const size_t valueSize =
                    pair.second == OF_Const::profName ?
                    sizeof(OF_Prefs::ProfileData_s::name) :
                    dataSize;

                if(pos + 2 + valueSize > sizeof(payload)) {
                    AppSerialSendError();
                    return false;
                }

                payload[pos++] = (uint8_t)valueSize;
                payload[pos++] = (uint8_t)profile;

                memcpy(&payload[pos],
                       (const uint8_t*)data + (dataSize * pair.second),
                       valueSize);

                pos += valueSize;
            }
        } else {
            // The last button entry is intentionally not managed by the App,
            // preserving the behaviour of the original implementation.
            if(buttonData &&
               pair.second >= ButtonCount - 1)
                continue;

            if(pos + 1 + dataSize > sizeof(payload)) {
                AppSerialSendError();
                return false;
            }

            payload[pos++] = (uint8_t)dataSize;

            memcpy(&payload[pos],
                   (const uint8_t*)data + (dataSize * pair.second),
                   dataSize);

            pos += dataSize;
        }

        if(!AppSerialSendResponse(command,
                                  payload,
                                  (uint8_t)pos))
            return false;
    }

    if(!sendFinal)
        return true;

    return AppSerialSendResponse(command, nullptr, 0, true);
}

bool OF_Serial::AppSerialReceiveRecord(
    const uint8_t *payload,
    uint8_t length,
    void *data,
    const std::unordered_map<std::string_view, int> &fields,
    size_t dataSize,
    bool profileData)
{
    if(payload == nullptr || length < 2)
        return false;

    const bool buttonData = data == OF_Prefs::backupButtonDesc;

    uint8_t nameLength = 0;

    while(nameLength < length &&
          payload[nameLength] != '\0')
        ++nameLength;

    // At least the string terminator and value-size byte must be present.
    if(nameLength >= length ||
       nameLength + 1 >= length)
        return false;

    const std::string_view fieldName(
        (const char*)payload,
        nameLength);

    size_t pos = nameLength + 1;
    const uint8_t valueSize = payload[pos++];

    // One lookup is sufficient and avoids scanning the field name again.
    const auto field = fields.find(fieldName);

    // Every frame contains exactly one record, therefore an unknown field
    // can be ignored safely for forward compatibility.
    if(field == fields.end())
        return true;

    const int index = field->second;

    if(index < 0)
        return true;

    if(profileData) {
        if(index == OF_Const::profCurrent) {
            // CurrentProf is transported as one byte even though the runtime
            // variable uses the native unsigned-integer type.
            if(valueSize != sizeof(uint8_t) ||
               pos + valueSize != length)
                return false;

            const uint8_t currentProfile = payload[pos];

            if(currentProfile >= PROFILE_COUNT)
                return false;

            OF_Prefs::currentProfile = currentProfile;
            return true;
        }

        // Every ordinary profile record also contains the profile number.
        if(pos >= length)
            return false;

        const uint8_t profNum = payload[pos++];

        if(profNum >= PROFILE_COUNT)
            return false;

        const size_t expectedSize =
            index == OF_Const::profName ?
            sizeof(OF_Prefs::ProfileData_s::name) :
            dataSize;

        if(valueSize != expectedSize ||
           pos + valueSize != length)
            return false;

        memcpy((uint8_t*)&OF_Prefs::profiles[profNum] +
                   (dataSize * index),
               &payload[pos],
               valueSize);

        return true;
    }

    if(valueSize != dataSize ||
       pos + valueSize != length)
        return false;

    // The last button entry is intentionally not managed by the App.
    if(buttonData &&
       index >= ButtonCount - 1)
        return true;

    memcpy((uint8_t*)data + (dataSize * index),
           &payload[pos],
           valueSize);

    return true;
}

void OF_Serial::PrintResults()
{
    if(millis() - lastPrintMillis < 100)
        return;

    #ifdef OPENFIRE_WIRELESS_ENABLE        
        if (!(TinyUSBDevices.onBattery ? SerialWireless : TinyUSBDevice.mounted())) { // [ESP32_PORT] poi decide come sistemare per bene ma così dovrebbe andare bene
    #else
    if(!Serial) {
    #endif
        FW_Common::stateFlags |= FW_Const::StateFlagsDtrReset;
        return;
    }

    if(FW_Common::stateFlags & FW_Const::StateFlag_PrintPreferences) {
        FW_Common::stateFlags &= ~FW_Const::StateFlag_PrintPreferences;

        // Prints basic storage device information
        // an estimation of storage used, though doesn't take extended prefs into account.
        if(FW_Common::stateFlags & FW_Const::StateFlag_PrintPreferencesStorage) {
            FW_Common::stateFlags &= ~FW_Const::StateFlag_PrintPreferencesStorage;
            
            #ifdef SAMCO_FLASH_ENABLE
                unsigned int required = OF_Prefs::Size();

            #ifndef PRINT_VERBOSE
                if(required < flash.size())
                    return;
            #endif

                Serial.print("NV Storage capacity: ");
                Serial.print(flash.size());
                Serial.print(", required size: ");
                Serial.println(required);

