alessandro-satanassi/OpenFIRE-Firmware-ESP32/lightgun/src/OpenFIREserial.cpp
            #ifdef PRINT_VERBOSE
                Serial.print("Profile struct size: ");
                Serial.print((unsigned int)sizeof(OF_Prefs::profileData_t));
                Serial.print(", Profile data array size: ");
                Serial.println((unsigned int)sizeof(OF_Prefs::profiles));
            #endif

            #endif // SAMCO_FLASH_ENABLE
        }

        // prints all stored preferences information in a table
        Serial.print("Default Profile: ");
        Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].name);
        
        Serial.println("Profiles:");
        for(uint i = 0; i < PROFILE_COUNT; ++i) {
            // report if a profile has been cal'd
            if(OF_Prefs::profiles[i].topOffset && OF_Prefs::profiles[i].bottomOffset &&
              OF_Prefs::profiles[i].leftOffset && OF_Prefs::profiles[i].rightOffset) {
                size_t len = strlen(OF_Prefs::profiles[i].name);
                Serial.print(OF_Prefs::profiles[i].name);
                while(len < 18) {
                    Serial.print(' ');
                    ++len;
                }
                Serial.print("Top: ");
                Serial.print(OF_Prefs::profiles[i].topOffset);
                Serial.print(", Bottom: ");
                Serial.print(OF_Prefs::profiles[i].bottomOffset);
                Serial.print(", Left: ");
                Serial.print(OF_Prefs::profiles[i].leftOffset);
                Serial.print(", Right: ");
                Serial.print(OF_Prefs::profiles[i].rightOffset);
                Serial.print(", TLled: ");
                Serial.print(OF_Prefs::profiles[i].TLled);
                Serial.print(", TRled: ");
                Serial.print(OF_Prefs::profiles[i].TRled);
                //Serial.print(", AdjX: ");
                //Serial.print(OF_Prefs::profiles[i].adjX);
                //Serial.print(", AdjY: ");
                //Serial.print(OF_Prefs::profiles[i].adjY);
                Serial.print(" IR: ");
                Serial.print((unsigned int)OF_Prefs::profiles[i].irSens);
                Serial.print(" Mode: ");
                Serial.print((unsigned int)OF_Prefs::profiles[i].runMode);
                Serial.print(" Layout: ");
                if(OF_Prefs::profiles[i].irLayout)
                    Serial.println("Diamond");
                else Serial.println("Square");
            }
        }
        /*
        Serial.print(finalX);
        Serial.print(" (");
        Serial.print(MoveXAxis);
        Serial.print("), ");
        Serial.print(finalY);
        Serial.print(" (");
        Serial.print(MoveYAxis);
        Serial.print("), H ");
        Serial.println(mySamco.H());*/

        //Serial.print("conMove ");
        //Serial.print(conMoveXAxis);
        //Serial.println(conMoveYAxis);
        
        if(FW_Common::stateFlags & FW_Const::StateFlag_PrintSelectedProfile) {
            FW_Common::stateFlags &= ~FW_Const::StateFlag_PrintSelectedProfile;

            // Print selected profile
            Serial.print("Profile: ");
            Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].name);

            // Print current sensitivity
            Serial.print("IR Camera Sensitivity: ");
            Serial.println((int)OF_Prefs::profiles[OF_Prefs::currentProfile].irSens);

            // Subroutine that prints current runmode
            if(FW_Common::runMode < FW_Const::RunMode_Count) {
                Serial.print("Mode: ");
                Serial.println(FW_Const::RunModeLabels[FW_Common::runMode]);
            }

            #ifdef USES_RUMBLE
                Serial.print("Rumble enabled: ");
                if(OF_Prefs::toggles[OF_Const::rumble])
                    Serial.println("True");
                else Serial.println("False");
            #endif // USES_RUMBLE

            #ifdef USES_SOLENOID
                Serial.print("Solenoid enabled: ");
                if(OF_Prefs::toggles[OF_Const::solenoid]) {
                    Serial.println("True");
                    Serial.print("Rapid fire enabled: ");
                    if(OF_Prefs::toggles[OF_Const::autofire])
                        Serial.println("True");
                    else Serial.println("False");

                    Serial.print("Burst fire enabled: ");
                    if(OF_FFB::burstFireActive)
                        Serial.println("True");
                    else Serial.println("False");
                }
                else Serial.println("False");
            #endif // USES_SOLENOID

            // #ifdef ARDUINO_ARCH_RP2040 // [ESP32_PORT] per ESP32
            #ifdef DUAL_CORE
                Serial.println("Running on dual cores.");
            #else
                Serial.println("Running on one core.");
            #endif // DUAL_CORE
            // #endif // ARDUINO_ARCH_RP2040 // [ESP32_PORT] per ESP32

            Serial.printf("Firmware version: v%.1f"
                          #ifdef GIT_HASH
                          "-%s"
                          #endif // GIT_ HASH);
                          , OPENFIRE_VERSION
                          #ifdef GIT_HASH
                          , GIT_HASH
                          #endif // GIT_HASH
                          );
        }
                    
        lastPrintMillis = millis();
    }
}

#ifdef DEBUG_SERIAL
void OF_Serial::PrintDebugSerial()
{
    // only print every second
    if(millis() - serialDbMs >= 1000 && Serial) {
        Serial.print("mode ");
        Serial.print(FW_Common::gunMode);
        Serial.print(", IR pos fps ");
        Serial.print(irPosCount);
        Serial.print(", loop/sec ");
        Serial.print(frameCount);

        /*
        Serial.print(", Mouse X,Y ");
        Serial.print(FW_Common::conMoveXAxis);
        Serial.print(",");
        Serial.println(FW_Common::conMoveYAxis);
        */
        
        frameCount = 0;
        irPosCount = 0;
        serialDbMs = millis();
    }
}
#endif // DEBUG_SERIAL

bool OF_Serial::Serial_available(uint8_t min) 
{
    // in futuro valutare di togliere questa funzione
    // Used by SerialProcessing(), which reads the serial port (not the App session link).
    if ((Serial.available() >= min)) return true;
    else {
        unsigned long timer_out = millis();
        while ((Serial.available() < min) && (millis() - timer_out < 1000)) yield();
        return Serial.available() >= min ? true : false;
    }
}

// ============ [ESP32_PORT] ============
// restore Serial after it was redefined for serial connections / ripristino di Serial dopo definizione per connessione seriali ==============
#ifdef OPENFIRE_WIRELESS_ENABLE
    #undef Serial
    #ifdef AUX_SERIAL
        #define Serial AUX_SERIAL
        #undef AuxSerial
    #endif
#endif // OPENFIRE_WIRELESS_ENABLE
// ============ [ESP32_PORT] ============
// restore Serial after it was redefined for serial connections / fine ripristino di Serial dopo definizione per connessione seriali ==============
